    <!DOCTYPE html>
<html lang="en-us" amp="">
	<head><meta charset="utf-8"><script async src="https://cdn.ampproject.org/v0.js"></script>
		
		<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
		<meta name="viewport" content="width=device-width, initial-scale=1">
		
		
		<meta name="generator" content="Hugo 0.51">
		<title>f8... &#xB7; Minko Gechev&apos;s blog</title>
		<link rel="shortcut icon" href="https://blog.mgechev.com/images/favicon.ico">
		<style amp-custom=""></style>
		<style amp-custom=""></style>
		<style amp-custom=""></style>
		

		
		<style amp-custom=""></style>
		

		
		<link href="https://blog.mgechev.com/feed.xml" rel="alternate" type="application/rss+xml" title="Minko Gechev&apos;s blog">
		
		
		<link rel="amphtml" href="https://blog.mgechev.com/amp/2011/09/23/f8-2/">
		

		<meta property="og:title" content="f8...">
		<meta property="og:description" content="&#x422;&#x430;&#x437;&#x438; &#x441;&#x443;&#x442;&#x440;&#x438;&#x43D; &#x43F;&#x443;&#x441;&#x43D;&#x430;&#x445; &#x43F;&#x440;&#x43E;&#x441;&#x43B;&#x43E;&#x432;&#x443;&#x442;&#x430;&#x442;&#x430; f8&#x2026;&#x411;&#x44F;&#x445; &#x441; &#x433;&#x43E;&#x43B;&#x435;&#x43C;&#x438; &#x43E;&#x447;&#x430;&#x43A;&#x432;&#x430;&#x43D;&#x438;&#x44F; (&#x434;&#x43E;&#x440;&#x438; &#x43F;&#x43E;&#x441;&#x442;&#x432;&#x430;&#x445; &#x437;&#x430; &#x43D;&#x435;&#x44F;), &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x438; &#x437;&#x430;&#x440;&#x430;&#x434;&#x438; &#x441;&#x43B;&#x430;&#x431;&#x430;&#x442;&#x430; &#x43C;&#x438; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x438;&#x440;&#x430;&#x43D;&#x43E;&#x441;&#x442; &#x43E;&#x447;&#x430;&#x43A;&#x432;&#x430;&#x445; &#x43D;&#x435;&#x449;&#x43E; &#x43A;&#x430;&#x442;&#x43E; Google I/O (&#x438;&#x43C;&#x430; &#x441;&#x438; Google&#x2026;&#x437;&#x430;&#x449;&#x43E; &#x43D;&#x435; &#x43F;&#x43E;&#x442;&#x44A;&#x440;&#x441;&#x438;&#x445; &#x43F;&#x440;&#x435;&#x434;&#x432;&#x430;&#x440;&#x438;&#x442;&#x435;&#x43B;&#x43D;&#x43E;&#x2026;). Streaming-a &#x442;&#x440;&#x44A;&#x433;&#x43D;&#x430; &#x438; &#x43E;&#x447;&#x430;&#x43A;&#x432;&#x430;&#x43D;&#x43E; &#x432;&#x438;&#x434;&#x44F;&#x445; &#x41C;&#x430;&#x440;&#x43A; &#x417;&#x443;&#x43A;&#x44A;&#x440;&#x431;&#x44A;&#x440;&#x433;. &#x412;&#x43C;&#x435;&#x441;&#x442;&#x43E; &#x442;&#x43E;&#x439; &#x434;&#x430; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438; &#x437;&#x430; &#x43D;&#x43E;&#x432;&#x438; &#x442;&#x435;&#x445;&#x43D;&#x43E;&#x43B;&#x43E;&#x433;&#x438;&#x438; &#x438; &#x441; &#x43A;&#x430;&#x43A;&#x432;&#x438; &#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x430; &#x435; &#x441;&#x44A;&#x437;&#x434;&#x430;&#x43B; &#x43D;&#x435;&#x449;&#x43E; &#x43D;&#x43E;&#x432;&#x43E;, &#x437;&#x430;&#x43F;&#x43E;&#x447;&#x43D;&#x430; &#x434;&#x430; &#x43F;&#x440;&#x430;&#x432;&#x438; &#x440;&#x435;&#x43A;&#x43B;&#x430;&#x43C;&#x430; &#x43D;&#x430; &#x43D;&#x43E;&#x432;&#x438;&#x442;&#x435; feature-&#x438; &#x43D;&#x430; Facebook&#x2026;&#x414;&#x430;&#x43C; &#x442;&#x440;&#x44F;&#x431;&#x432;&#x430;&#x448;&#x435; &#x434;&#x430; &#x43F;&#x440;&#x43E;&#x447;&#x435;&#x442;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x447;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x438; &#x434;&#x430; &#x441;&#x438; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x44F; &#x447;&#x430;&#x441;&#x43E;&#x432;&#x43D;&#x438;&#x43A;&#x430; &#x434;&#x430; &#x437;&#x432;&#x44A;&#x43D;&#x438; &#x442;&#x43E;&#x43B;&#x43A;&#x43E;&#x432;&#x430; &#x440;&#x430;&#x43D;&#x43E;&#x2026;">
		<meta property="og:type" content="article">
		<meta property="og:url" content="https://blog.mgechev.com/2011/09/23/f8-2/">
		
		<meta property="og:image" content="https://blog.mgechev.com/images/myself.jpg">
		<meta property="og:image:secure_url" content="https://blog.mgechev.com/images/myself.jpg">
		
	<meta name="viewport" content="width=device-width,minimum-scale=1,initial-scale=1"><style amp-boilerplate="">body{-webkit-animation:-amp-start 8s steps(1,end) 0s 1 normal both;-moz-animation:-amp-start 8s steps(1,end) 0s 1 normal both;-ms-animation:-amp-start 8s steps(1,end) 0s 1 normal both;animation:-amp-start 8s steps(1,end) 0s 1 normal both}@-webkit-keyframes -amp-start{from{visibility:hidden}to{visibility:visible}}@-moz-keyframes -amp-start{from{visibility:hidden}to{visibility:visible}}@-ms-keyframes -amp-start{from{visibility:hidden}to{visibility:visible}}@-o-keyframes -amp-start{from{visibility:hidden}to{visibility:visible}}@keyframes -amp-start{from{visibility:hidden}to{visibility:visible}}</style><noscript><style amp-boilerplate="">body{-webkit-animation:none;-moz-animation:none;-ms-animation:none;animation:none}</style></noscript></head>

    <body>
       <nav class="main-nav">
  
  <div class="link-wrapper">
	
	
		<a href="https://blog.mgechev.com/"> <span class="arrow">&#x2190;</span>Home</a>
	
	<a href="https://blog.mgechev.com/post">Posts</a>
	<a href="https://blog.mgechev.com/about">About</a>
	<a href="https://blog.mgechev.com/talks">Speaking</a>
  </div>

	

	
  
	
</nav>
<a href="https://github.com/mgechev" class="github-corner" aria-label="View source on Github"><svg width="80" height="80" viewbox="0 0 250 250" style="z-index: 100000; fill:#70B7FD; color:#fff; position: fixed; top: 20px; border: 0; left: 20px; transform: scale(-1.5, 1.5);" aria-hidden="true"><path d="M0,0 L115,115 L130,115 L142,142 L250,250 L250,0 Z"/><path d="M128.3,109.0 C113.8,99.7 119.0,89.6 119.0,89.6 C122.0,82.7 120.5,78.6 120.5,78.6 C119.2,72.0 123.4,76.3 123.4,76.3 C127.3,80.9 125.5,87.3 125.5,87.3 C122.9,97.6 130.6,101.9 134.4,103.2" fill="currentColor" style="transform-origin: 130px 106px;" class="octo-arm"/><path d="M115.0,115.0 C114.9,115.1 118.7,116.5 119.8,115.4 L133.7,101.6 C136.9,99.2 139.9,98.4 142.2,98.6 C133.8,88.0 127.5,74.4 143.8,58.0 C148.5,53.4 154.0,51.2 159.7,51.0 C160.3,49.4 163.2,43.6 171.4,40.1 C171.4,40.1 176.1,42.5 178.8,56.2 C183.1,58.6 187.2,61.8 190.9,65.4 C194.5,69.0 197.7,73.2 200.1,77.6 C213.8,80.2 216.3,84.9 216.3,84.9 C212.7,93.1 206.9,96.0 205.4,96.6 C205.1,102.4 203.0,107.8 198.3,112.5 C181.9,128.9 168.3,122.5 157.7,114.1 C157.9,116.9 156.7,120.9 152.7,124.9 L141.0,136.5 C139.8,137.7 141.6,141.9 141.8,141.8 Z" fill="currentColor" class="octo-body"/></svg></a><style>.github-corner:hover .octo-arm{animation:octocat-wave 560ms ease-in-out}@keyframes octocat-wave{0%,100%{transform:rotate(0)}20%,60%{transform:rotate(-25deg)}40%,80%{transform:rotate(10deg)}}@media (max-width:500px){.github-corner:hover .octo-arm{animation:none}.github-corner .octo-arm{animation:octocat-wave 560ms ease-in-out}}</style>


        <section id="wrapper">
            <article class="post">
                <header>
                    <h1>
                        f8...
                    </h1>
                    <h2 class="headline">
                    <a href="https://github.com/mgechev/blog.mgechev.com/tree/master/content/post/2011-09-23-f8-2.md">
                        <i class="fa fa-pencil-square-o"></i> Edit
                    </a>
                    &#xB7; Sep 23, 2011
                    &#xB7; 2 minutes read
                    &#xB7; <a href="https://twitter.com/mgechev?ref_src=twsrc%5Etfw" class="twitter-follow-button" data-show-count="true">Follow @mgechev</a><script async src="https://platform.twitter.com/widgets.js" charset="utf-8"></script>
                      <span class="tags">
                      
                      
                          
                              <a href="https://blog.mgechev.com/tags/facebook">Facebook</a>
                          
                              <a href="https://blog.mgechev.com/tags/internet">Internet</a>
                          
                              <a href="https://blog.mgechev.com/tags/social-networks">Social networks</a>
                          
                      
                      
                      </span>
                    </h2>
                </header>
                
                <section id="post-body">
                    <p>&#x422;&#x430;&#x437;&#x438; &#x441;&#x443;&#x442;&#x440;&#x438;&#x43D; &#x43F;&#x443;&#x441;&#x43D;&#x430;&#x445; &#x43F;&#x440;<amp-img class="alignleft" title="Facebook Graph" src="http://infosthetics.com/archives/facebook_graph2.jpg" alt="" width="244" height="244"></amp-img>&#x43E;&#x441;&#x43B;&#x43E;&#x432;&#x443;&#x442;&#x430;&#x442;&#x430; f8&#x2026;&#x411;&#x44F;&#x445; &#x441; &#x433;&#x43E;&#x43B;&#x435;&#x43C;&#x438; &#x43E;&#x447;&#x430;&#x43A;&#x432;&#x430;&#x43D;&#x438;&#x44F; (&#x434;&#x43E;&#x440;&#x438; &#x43F;&#x43E;&#x441;&#x442;&#x432;&#x430;&#x445; &#x437;&#x430; &#x43D;&#x435;&#x44F;), &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x438; &#x437;&#x430;&#x440;&#x430;&#x434;&#x438; &#x441;&#x43B;&#x430;&#x431;&#x430;&#x442;&#x430; &#x43C;&#x438; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x438;&#x440;&#x430;&#x43D;&#x43E;&#x441;&#x442; &#x43E;&#x447;&#x430;&#x43A;&#x432;&#x430;&#x445; &#x43D;&#x435;&#x449;&#x43E; &#x43A;&#x430;&#x442;&#x43E; Google I/O (&#x438;&#x43C;&#x430; &#x441;&#x438; Google&#x2026;&#x437;&#x430;&#x449;&#x43E; &#x43D;&#x435; &#x43F;&#x43E;&#x442;&#x44A;&#x440;&#x441;&#x438;&#x445; &#x43F;&#x440;&#x435;&#x434;&#x432;&#x430;&#x440;&#x438;&#x442;&#x435;&#x43B;&#x43D;&#x43E;&#x2026;). Streaming-a &#x442;&#x440;&#x44A;&#x433;&#x43D;&#x430; &#x438; &#x43E;&#x447;&#x430;&#x43A;&#x432;&#x430;&#x43D;&#x43E; &#x432;&#x438;&#x434;&#x44F;&#x445; &#x41C;&#x430;&#x440;&#x43A; &#x417;&#x443;&#x43A;&#x44A;&#x440;&#x431;&#x44A;&#x440;&#x433;. &#x412;&#x43C;&#x435;&#x441;&#x442;&#x43E; &#x442;&#x43E;&#x439; &#x434;&#x430; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438; &#x437;&#x430; &#x43D;&#x43E;&#x432;&#x438; &#x442;&#x435;&#x445;&#x43D;&#x43E;&#x43B;&#x43E;&#x433;&#x438;&#x438; &#x438; &#x441; &#x43A;&#x430;&#x43A;&#x432;&#x438; &#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x430; &#x435; &#x441;&#x44A;&#x437;&#x434;&#x430;&#x43B; &#x43D;&#x435;&#x449;&#x43E; &#x43D;&#x43E;&#x432;&#x43E;, &#x437;&#x430;&#x43F;&#x43E;&#x447;&#x43D;&#x430; &#x434;&#x430; &#x43F;&#x440;&#x430;&#x432;&#x438; &#x440;&#x435;&#x43A;&#x43B;&#x430;&#x43C;&#x430; &#x43D;&#x430; &#x43D;&#x43E;&#x432;&#x438;&#x442;&#x435; feature-&#x438; &#x43D;&#x430; Facebook&#x2026;&#x414;&#x430;&#x43C; &#x442;&#x440;&#x44F;&#x431;&#x432;&#x430;&#x448;&#x435; &#x434;&#x430; &#x43F;&#x440;&#x43E;&#x447;&#x435;&#x442;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x447;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x438; &#x434;&#x430; &#x441;&#x438; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x44F; &#x447;&#x430;&#x441;&#x43E;&#x432;&#x43D;&#x438;&#x43A;&#x430; &#x434;&#x430; &#x437;&#x432;&#x44A;&#x43D;&#x438; &#x442;&#x43E;&#x43B;&#x43A;&#x43E;&#x432;&#x430; &#x440;&#x430;&#x43D;&#x43E;&#x2026;<br>
&#x421;&#x43F;&#x43E;&#x43C;&#x435;&#x43D;&#x430; &#x437;&#x430; Facebook Timeline (&#x432;&#x441;&#x44A;&#x449;&#x43D;&#x43E;&#x441;&#x442; &#x43D;&#x435; &#x441;&#x43F;&#x43E;&#x43C;&#x435;&#x43D;&#x430;, &#x430; &#x431;&#x435;&#x448;&#x435; &#x445;&#x432;&#x430;&#x43B;&#x435;&#x43D; &#x43E;&#x442; &#x43A;&#x43E;&#x433;&#x43E; &#x43B;&#x438; &#x43D;&#x435;). &#x422;&#x43E;&#x437;&#x438; timeline &#x43D;&#x430; &#x43C;&#x435;&#x43D; &#x43C;&#x438; &#x441;&#x435; &#x432;&#x438;&#x434;&#x44F; &#x43C;&#x430;&#x43B;&#x43A;&#x43E; &#x43F;&#x43B;&#x430;&#x448;&#x435;&#x449;&#x2026;&#x42F;&#x441;&#x43D;&#x43E; &#x435;, &#x447;&#x435; facebook, &#x437;&#x43D;&#x430;&#x44F;&#x442; &#x432;&#x441;&#x438;&#x447;&#x43A;&#x43E; &#x437;&#x430; &#x442;&#x435;&#x431; &#x43E;&#x442; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x43D;&#x430; &#x440;&#x435;&#x433;&#x438;&#x441;&#x442;&#x440;&#x430;&#x446;&#x438;&#x44F;&#x442;&#x430; &#x442;&#x438;, &#x43D;&#x43E; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E; &#x43B;&#x438; &#x435; &#x434;&#x430; &#x437;&#x43D;&#x430;&#x44F;&#x442; &#x438; &#x43E;&#x442; &#x43F;&#x440;&#x435;&#x434;&#x438; &#x442;&#x43E;&#x432;&#x430;?! &#x417;&#x430;&#x449;&#x43E; &#x442;&#x440;&#x44F;&#x431;&#x432;&#x430; &#x434;&#x430; &#x441;&#x43F;&#x43E;&#x434;&#x435;&#x43B;&#x44F;&#x448; &#x446;&#x435;&#x43B;&#x438;&#x44F; &#x441;&#x438; &#x436;&#x438;&#x432;&#x43E;&#x442; &#x441; &#x43D;&#x435;&#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x442;&#x438;&#x2026;&#x41D;&#x43E; &#x432;&#x441;&#x435; &#x43F;&#x430;&#x43A;&#x2026;&#x434;&#x430; &#x43A;&#x430;&#x436;&#x435;&#x43C;, &#x447;&#x435; &#x442;&#x43E;&#x432;&#x430; &#x43D;&#x435; &#x435; &#x442;&#x43E;&#x43B;&#x43A;&#x43E;&#x432;&#x430; &#x43E;&#x43F;&#x430;&#x441;&#x43D;&#x43E;&#x2026;&#x412;&#x44A;&#x43F;&#x440;&#x435;&#x43A;&#x438;, &#x447;&#x435; &#x43D;&#x435;&#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x442; &#x447;&#x43E;&#x432;&#x435;&#x43A; &#x43C;&#x43E;&#x436;&#x435; &#x434;&#x430; &#x442;&#x435; &#x441;&#x440;&#x435;&#x449;&#x43D;&#x435; &#x43D;&#x430; &#x443;&#x43B;&#x438;&#x446;&#x430;&#x442;&#x430; &#x438; &#x434;&#x430; &#x437;&#x430;&#x43F;&#x43E;&#x447;&#x43D;&#x435; &#x434;&#x430; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438; &#x43D;&#x435;&#x449;&#x430; &#x437;&#x430; &#x43C;&#x438;&#x43D;&#x430;&#x43B;&#x43E;&#x442;&#x43E; &#x442;&#x438;, &#x43A;&#x43E;&#x438;&#x442;&#x43E; &#x441;&#x430;&#x43C;&#x43E; &#x43D;&#x430;&#x439;-&#x431;&#x43B;&#x438;&#x437;&#x43A;&#x438;&#x442;&#x435; &#x442;&#x438; &#x440;&#x43E;&#x434;&#x43D;&#x438;&#x43D;&#x438; &#x441;&#x430; &#x437;&#x43D;&#x430;&#x435;&#x43B;&#x438; &#x438; &#x442;&#x43E; &#x435;&#x434;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43E; &#x43F;&#x43E;&#x440;&#x430;&#x434;&#x438; &#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x430;&#x442;&#x430;, &#x447;&#x435; &#x43D;&#x435; &#x441;&#x438; &#x440;&#x435;&#x434;&#x430;&#x43A;&#x442;&#x438;&#x440;&#x430;&#x43B; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x43D;&#x43E; private &#x43E;&#x43F;&#x446;&#x438;&#x438;&#x442;&#x435; &#x43D;&#x430; &#x430;&#x43A;&#x430;&#x443;&#x43D;&#x442;&#x430; &#x441;&#x438;. &#x41C;&#x43E;&#x436;&#x435; &#x431;&#x438; &#x434;&#x43E;&#x440;&#x438; &#x43F;&#x43E;-&#x43F;&#x43B;&#x430;&#x448;&#x435;&#x449;&#x430; &#x43D;&#x43E;&#x432;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x43D;&#x43E;&#x441;&#x442; &#x435; Facebook Graph. &#x422;&#x43E;&#x432;&#x430; &#x435; &#x435;&#x434;&#x438;&#x43D; &#x43C;&#x443;&#x43B;&#x442;&#x438; &#x433;&#x440;&#x430;&#x444;, &#x432; &#x43A;&#x43E;&#x439;&#x442;&#x43E; &#x43E;&#x442;&#x434;&#x435;&#x43B;&#x43D;&#x438;&#x442;&#x435; &#x432;&#x44A;&#x437;&#x43B;&#x438; &#x441;&#x430; facebook &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x438;&#x442;&#x435;&#x43B;&#x438;&#x442;&#x435;, &#x430; &#x440;&#x435;&#x431;&#x440;&#x430;&#x442;&#x430; &#x43C;&#x435;&#x436;&#x434;&#x443; &#x442;&#x44F;&#x445; &#x441;&#x430; &#x43E;&#x431;&#x449;&#x438;&#x442;&#x435; &#x43D;&#x435;&#x449;&#x430; &#x43C;&#x435;&#x436;&#x434;&#x443; &#x442;&#x435;&#x437;&#x438; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x438;&#x442;&#x435;&#x43B;&#x438;. &#x412; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x439;, &#x447;&#x435; &#x441;&#x432;&#x44A;&#x440;&#x436;&#x435;&#x448;<amp-img class="alignright" title="Facebook" src="http://cdn.inquisitr.com/wp-content/2011/07/Facebook-Logo.jpg" alt="" width="230" height="161"></amp-img> &#x43D;&#x44F;&#x43A;&#x43E;&#x44F; &#x442;&#x432;&#x43E;&#x44F; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430;, &#x441; &#x43A;&#x43E;&#x44F;&#x442;&#x43E; &#x434;&#x43E; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x441;&#x438; &#x441;&#x43B;&#x443;&#x448;&#x430;&#x43B; &#x43C;&#x443;&#x437;&#x438;&#x43A;&#x430;, &#x441; facebook &#x43E;&#x442;&#x441;&#x435;&#x433;&#x430; &#x43D;&#x430;&#x442;&#x430;&#x442;&#x44A;&#x43A;, &#x43D;&#x435; &#x441;&#x430;&#x43C;&#x43E; &#x449;&#x435; &#x441;&#x43B;&#x443;&#x448;&#x430;&#x448; &#x43C;&#x443;&#x437;&#x438;&#x43A;&#x430; &#x441; &#x43D;&#x435;&#x44F;, &#x430; &#x438; &#x442;&#x44F; &#x449;&#x435; &#x434;&#x43E;&#x43A;&#x43B;&#x430;&#x434;&#x432;&#x430; &#x43A;&#x43E;&#x433;&#x430;, &#x43A;&#x43E;&#x44F; &#x43F;&#x435;&#x441;&#x435;&#x43D;, &#x43E;&#x442; &#x43A;&#x44A;&#x434;&#x435; &#x438; &#x442;.&#x43D; &#x441;&#x438; &#x441;&#x43B;&#x443;&#x448;&#x430;&#x43B;. &#x422;&#x43E;&#x432;&#x430; &#x43D;&#x435; &#x441;&#x435; &#x43E;&#x442;&#x43D;&#x430;&#x441;&#x44F; &#x441;&#x430;&#x43C;&#x43E; &#x437;&#x430; &#x43C;&#x443;&#x437;&#x438;&#x43A;&#x430; &#x438; &#x43F;&#x435;&#x441;&#x43D;&#x438;, &#x440;&#x430;&#x437;&#x431;&#x438;&#x440;&#x430; &#x441;&#x435;. Facebook &#x43D;&#x435; &#x431;&#x438;&#x445;&#x430; &#x441;&#x435; &#x441;&#x43F;&#x440;&#x44F;&#x43B;&#x438; &#x441;&#x430;&#x43C;&#x43E; &#x441; &#x442;&#x43E;&#x432;&#x430;. &#x41E;&#x441;&#x432;&#x435;&#x43D; &#x43C;&#x443;&#x437;&#x438;&#x43A;&#x430; &#x438;&#x43C;&#x430; &#x441;&#x44A;&#x449;&#x430;&#x442;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x43D;&#x43E;&#x441;&#x442; &#x438; &#x437;&#x430; &#x444;&#x438;&#x43B;&#x43C;&#x438;, &#x433;&#x43E;&#x442;&#x432;&#x435;&#x43D;&#x435;, &#x434;&#x43E;&#x440;&#x438; &#x442;&#x438;&#x447;&#x430;&#x43D;&#x435; &#x432; &#x43F;&#x430;&#x440;&#x43A;&#x430; (&#x430; &#x441;&#x44A;&#x449;&#x43E; &#x442;&#x430;&#x43A;&#x430; &#x438; &#x43E;&#x449;&#x435; &#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x434;&#x440;&#x443;&#x433;&#x438;). &#x418;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x43D;&#x43E;&#x442;&#x43E; &#x435;, &#x447;&#x435; &#x432;&#x44A;&#x43F;&#x440;&#x435;&#x43A;&#x438; &#x432;&#x441;&#x438;&#x447;&#x43A;&#x438; &#x442;&#x435;&#x437;&#x438; feature-&#x438;, &#x441; &#x43A;&#x43E;&#x438;&#x442;&#x43E; &#x43E;&#x447;&#x435;&#x432;&#x438;&#x434;&#x43D;&#x43E; &#x432;&#x441;&#x435;&#x43A;&#x438; &#x43C;&#x43E;&#x436;&#x435; &#x434;&#x430; &#x431;&#x44A;&#x434;&#x435; &#x441;&#x43B;&#x435;&#x434;&#x435;&#x43D;, &#x445;&#x43E;&#x440;&#x430; &#x43F;&#x440;&#x43E;&#x434;&#x44A;&#x43B;&#x436;&#x430;&#x432;&#x430;&#x442; &#x434;&#x430; &#x441;&#x435; &#x440;&#x435;&#x433;&#x438;&#x441;&#x442;&#x440;&#x438;&#x440;&#x430;&#x442; &#x432;&#x44A;&#x432; facebook &#x432;&#x441;&#x435;&#x43A;&#x438; &#x434;&#x435;&#x43D;&#x2026;&#x432;&#x435;&#x447;&#x435; &#x43D;&#x430;&#x434; 800 000 000 &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x438;&#x442;&#x435;&#x43B;&#x438; &#x441;&#x430; &#x432; Cassandra. &#x410; &#x43C;&#x435;&#x436;&#x434;&#x443; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x442;&#x43E; &#x41C;&#x430;&#x440;&#x43A; &#x43E;&#x442;&#x43D;&#x43E;&#x432;&#x43E; &#x43D;&#x435; &#x43D;&#x430;&#x43F;&#x440;&#x430;&#x432;&#x438; &#x43D;&#x438;&#x449;&#x43E; &#x43D;&#x43E;&#x432;&#x43E; :). &#x422;&#x430;&#x437;&#x438; &#x201C;&#x432;&#x435;&#x43B;&#x438;&#x43A;&#x43E;&#x43B;&#x435;&#x43F;&#x43D;&#x430;&#x201D; &#x438;&#x434;&#x435;&#x44F; &#x441;&#x44A;&#x441; &#x441;&#x43B;&#x435;&#x434;&#x435;&#x43D;&#x435;&#x442;&#x43E; &#x43D;&#x430; &#x435;&#x436;&#x435;&#x434;&#x43D;&#x435;&#x432;&#x438;&#x435;&#x442;&#x43E; &#x43D;&#x435; &#x433;&#x43E; &#x435; &#x443;&#x434;&#x430;&#x440;&#x438;&#x43B;&#x430; &#x438;&#x437;&#x432;&#x435;&#x434;&#x43D;&#x44A;&#x436; &#x43F;&#x43E; &#x433;&#x43B;&#x430;&#x432;&#x430;&#x442;&#x430;&#x2026;Last.fm&#x2026;</p>

                </section>
            </article>

            

            
                <div id="disqus_thread"></div>
<script type="text/javascript">
    var disqus_shortname = 'mgechev';

     
    (function () {
        var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
        dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    })();

</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>

            

            

            <footer id="footer">
    <div class="by-author">with <i class="fa fa-heart" aria-hidden="true"></i> by Minko Gechev</div>
    <p class="small">
         &#xA9; Copyright 2018  
    </p>
</footer>
        </section>

        <script src="https://blog.mgechev.com/js/main.js"></script>




  
<script type="application/javascript">
var doNotTrack = false;
if (!doNotTrack) {
	(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
	(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
	m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
	})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
	ga('create', 'UA-18060688-3', 'auto');
	
	ga('send', 'pageview');
}
</script>



<script async src="//twemoji.maxcdn.com/2/twemoji.min.js?2.3.0"></script>
<script>
  window.addEventListener('load', function () {
    twemoji.parse(document.body, { size: 72 });
  });
</script>



    </body>
</html>
